<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 流年 <liu21st@gmail.com>
// +----------------------------------------------------------------------

// 应用公共文件
// 自动登录
 function _initialize(){
        //判断用户是否已经登录
        if (!isset($_SESSION['uid'])) {
            $this->error('对不起,您还没有登录!请先登录再进行浏览', U('Login/login'), 1);
        }
    }